code/openfoam/tutorials/multiRegion/CHT/heatedDuct/0/metal/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/metal";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "metal(Inlet|Outlet|External)"
    {
        type            zeroGradient;
    }
    metal_to_fluid
    {
        type            coupledTemperature;
        value           $internalField;
    }
    metal_to_heater
    {
        type            coupledTemperature;
        value           $internalField;
    }
}


// ************************************************************************* //
